//============================================================================
// 
// 惑星 [planet.cpp]
// Author : 後藤優輝
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "GameBg.h"
#include "texture.manager.h"
#include "window.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace useful;

//============================================================================
// コンストラクタ
//============================================================================
CGameBg::CGameBg(OBJ::TYPE Type, OBJ::LAYER Layer)
	: CObject2D(Type, Layer)
{

}

//============================================================================
// デストラクタ
//============================================================================
CGameBg::~CGameBg()
{

}

//============================================================================
// 更新処理
//============================================================================
void CGameBg::Update()
{
	CObject2D::Update();
}

//============================================================================
// 描画処理
//============================================================================
void CGameBg::Draw()
{
	CObject2D::Draw();
}

//============================================================================
// 生成
//============================================================================
CGameBg* CGameBg::Create()
{
	CGameBg* p = DBG_NEW CGameBg(OBJ::TYPE::GAMEBG, OBJ::LAYER::BG);

	//初期化処理
	p->Initialize();

	// どっかローカルに置いたパラメータ
	float ScreenHeight = CWindow::FWINDOW_HEIGHT / 2;
	float ScreenWidth = CWindow::FWINDOW_WIDTH / 2;

	D3DXVECTOR3 Pos = { ScreenWidth, ScreenHeight, 0.0f };
	D3DXVECTOR3 SizeSize = { ScreenWidth, ScreenHeight, 0.0f };
	D3DXVECTOR3 Rot = { 0.0f, 0.0f, 0.0f };


	p->SetPos(Pos);//位置設定
	p->SetRot(Rot);//向き設定
	p->SetSize(SizeSize);//大きさ設定
	p->BindTex(CTextureManager::RefInstance().RefRegistry().BindAtKey("BG"));//テクスチャの設定

	return p;
}