//============================================================================
// 
// シーンマネージャー、ヘッダファイル [scene_manager.hpp]
// Author : 福田歩希
// 
//============================================================================

// インクルードガード
#pragma once

//****************************************************
// インクルードファイル
//****************************************************
#include "singleton.h"
#include "scene.h"

//****************************************************
// シーンマネージャークラスの定義
//****************************************************
class CSceneManager final : public CSingleton<CSceneManager>
{
	//****************************************************
	// フレンド宣言
	//****************************************************
	friend struct std::default_delete<CSceneManager>;
	friend CSceneManager& CSingleton<CSceneManager>::RefInstance();

public:

	//****************************************************
	// function
	//****************************************************
	
	// シーン変更
	void ChangeScene(useful::up<CScene>&& upScene);

	// シーン取得
	inline const useful::up<CScene>& GetScene() { return m_upScene; };

private:

	//****************************************************
	// special function
	//****************************************************
	CSceneManager();			// デフォルトコンストラクタ
	~CSceneManager() override;	// デストラクタ

	//****************************************************
	// function
	//****************************************************
	bool Initialize();	// 初期化処理
	void Finalize();	// 終了処理

	//****************************************************
	// data
	//****************************************************
	useful::up<CScene> m_upScene;	// シーンのポインタ
};