//============================================================================
// 
// シーン - 基底、ヘッダファイル [scene.hpp]
// Author : 福田歩希
// 
//============================================================================

// インクルードガード
#pragma once

//****************************************************
// シーンクラスの定義
//****************************************************
class CScene
{
public:

	//****************************************************
	// special function
	//****************************************************
			CScene()  = default;	// デフォルトコンストラクタ
	virtual ~CScene() = default;	// デストラクタ

	//****************************************************
	// function
	//****************************************************

	/**
	 * 各派生シーン用の更新処理です
	 * シーンマネージャーの更新で自動的に呼び出されます
	 */
	virtual void Update() = 0;

	/**
	 * 各派生シーン用の描画処理です
	 * シーンマネージャーの描画で自動的に呼び出されます
	 */
	virtual void Draw() = 0;

	/**
	 * 更新時にこの関数を呼ぶと、設定されている次のシーンに遷移します
	 * 基本的にフレーム終わりに呼び出してください
	 */
	virtual	void Change() = 0;

//private:

	//****************************************************
	// function
	//****************************************************
	virtual bool Initialize() = 0;	// 初期設定
	virtual void Finalize()   = 0;	// 終了処理
};