//============================================================================
// 
// タイトル [title.cpp]
// Author : 福田歩希
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "title.h"
#include "sound.h"

// 入力取得用
#include "renderer.h"
#include "input.manager.h"

// シーン遷移用
#include "tutorial.h"
#include "scene_manager.h"
#include "object.manager.h"

#include "object_X.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace useful;

//============================================================================
// デフォルトコンストラクタ
//============================================================================
CTitle::CTitle()
	: CScene()
{}

//============================================================================
// デストラクタ
//============================================================================
CTitle::~CTitle()
{
	// 終了処理
	Finalize();
}

//============================================================================
// 更新処理
//============================================================================
void CTitle::Update()
{
#ifdef _DEBUG
	CRenderer::RefInstance().AddText("タイトル", 1);
#endif // _DEBUG

	// 次のシーンへ遷移
	if (CInputManager::RefInstance().GetKeyboard()->GetTrigger(DIK_RETURN))
	{
		Change();
	}
}

//============================================================================
// 描画処理
//============================================================================
void CTitle::Draw()
{}

//============================================================================
// 次のシーンへ
//============================================================================
void CTitle::Change()
{
	// 全オブジェクト解放予約
	CObjectManager::RefInstance().SetDeathAllObject();

	// サウンド by AKR TNK
	CSound::GetInstance()->Stop(CSound::LABEL::BGM_0);

	// チュートリアルシーンへ変更
	up<CTutorial> upScene = CreateUniquePtr<CTutorial>();
	CSceneManager::RefInstance().ChangeScene(std::move(upScene));
}

//============================================================================
// 初期化処理
//============================================================================
bool CTitle::Initialize()
{
	// サウンド by AKR TNK
	CSound::GetInstance()->Play(CSound::LABEL::BGM_0);

	CCamera_Manager::RefInstance().SetSelectKey("Title");

	CObject_X::Create(OBJ::TYPE::NONE, OBJ::LAYER::DEFAULT, nullptr);

	return true;
}

//============================================================================
// 終了処理
//============================================================================
void CTitle::Finalize()
{}