//============================================================================
// 
// 引力[gravity.cpp]
// Author : 梅田爽真
// 
//============================================================================

//****************************************************
// インクルードファイル
//****************************************************
#include "gravity.h"

//****************************************************
// usingディレクティブ
//****************************************************
using namespace useful;

//============================================================================
// コンストラクタ
//============================================================================
CGravity::CGravity(OBJ::TYPE Type, OBJ::LAYER Layer)
	: CObject2D(Type, Layer)
{

}

//============================================================================
// デストラクタ
//============================================================================
CGravity::~CGravity()
{

}

void CGravity::Update()
{
	D3DXVECTOR3 pos = GetPos();

	// 円２の情報
	D3DXVECTOR3 PlayerPos = { 25.0f ,30.0f ,0.0f };
	float PlayerRadius = 8.0f;

	float cal_a = pos.x - PlayerPos.x;	// x の計算
	float cal_b = pos.y - PlayerPos.y;	// y の計算

	// 計算した結果(距離)
	float distance = sqrt(cal_a * cal_a + cal_b * cal_b);

	// 距離が二つの円の大きさ以下の時
	if (distance <= m_GravityRadius + PlayerRadius)
	{

	}
}

CGravity* CGravity::Create(D3DXVECTOR3 pos, float radius)
{
	return nullptr;
}
